Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpio.h
/*
; stm32V873_gpio.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_gpio equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// GPIO address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    MODER;
    volatile    uint32_t    OTYPER;
    volatile    uint32_t    OSPEEDR;
    volatile    uint32_t    PUPDR;
    volatile    uint32_t    IDR;
    volatile    uint32_t    ODR;
    volatile    uint32_t    BSRR;
    volatile    uint32_t    LCKR;
    volatile    uint32_t    AFRL;
    volatile    uint32_t    AFRH;
    volatile    uint32_t    BRR;
    volatile    uint32_t    HSLVR;
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RCFGLOCKR;
    volatile    uint32_t    DELAYRL;
    volatile    uint32_t    DELAYRH;
    volatile    uint32_t    PIOCFGRL;
    volatile    uint32_t    PIOCFGRH;
} GPIO_TypeDef;

#if (defined(__cplusplus))
#define GPIOA_NS    reinterpret_cast<GPIO_TypeDef *>(0x46020000u)
#define GPIOA_S     reinterpret_cast<GPIO_TypeDef *>(0x56020000u)
#define GPIOB_NS    reinterpret_cast<GPIO_TypeDef *>(0x46020400u)
#define GPIOB_S     reinterpret_cast<GPIO_TypeDef *>(0x56020400u)
#define GPIOC_NS    reinterpret_cast<GPIO_TypeDef *>(0x46020800u)
#define GPIOC_S     reinterpret_cast<GPIO_TypeDef *>(0x56020800u)
#define GPIOD_NS    reinterpret_cast<GPIO_TypeDef *>(0x46020C00u)
#define GPIOD_S     reinterpret_cast<GPIO_TypeDef *>(0x56020C00u)
#define GPIOE_NS    reinterpret_cast<GPIO_TypeDef *>(0x46021000u)
#define GPIOE_S     reinterpret_cast<GPIO_TypeDef *>(0x56021000u)
#define GPIOF_NS    reinterpret_cast<GPIO_TypeDef *>(0x46021400u)
#define GPIOF_S     reinterpret_cast<GPIO_TypeDef *>(0x56021400u)
#define GPIOG_NS    reinterpret_cast<GPIO_TypeDef *>(0x46021800u)
#define GPIOG_S     reinterpret_cast<GPIO_TypeDef *>(0x56021800u)
#define GPIOH_NS    reinterpret_cast<GPIO_TypeDef *>(0x46021C00u)
#define GPIOH_S     reinterpret_cast<GPIO_TypeDef *>(0x56021C00u)
#define GPIOI_NS    reinterpret_cast<GPIO_TypeDef *>(0x46022000u)
#define GPIOI_S     reinterpret_cast<GPIO_TypeDef *>(0x56022000u)
#define GPIOJ_NS    reinterpret_cast<GPIO_TypeDef *>(0x46022400u)
#define GPIOJ_S     reinterpret_cast<GPIO_TypeDef *>(0x56022400u)
#define GPIOK_NS    reinterpret_cast<GPIO_TypeDef *>(0x46022800u)
#define GPIOK_S     reinterpret_cast<GPIO_TypeDef *>(0x56022800u)
#define GPIOM_NS    reinterpret_cast<GPIO_TypeDef *>(0x46023000u)
#define GPIOM_S     reinterpret_cast<GPIO_TypeDef *>(0x56023000u)

#else
#define GPIOA_NS    ((GPIO_TypeDef *)0x46020000u)
#define GPIOA_S     ((GPIO_TypeDef *)0x56020000u)
#define GPIOB_NS    ((GPIO_TypeDef *)0x46020400u)
#define GPIOB_S     ((GPIO_TypeDef *)0x56020400u)
#define GPIOC_NS    ((GPIO_TypeDef *)0x46020800u)
#define GPIOC_S     ((GPIO_TypeDef *)0x56020800u)
#define GPIOD_NS    ((GPIO_TypeDef *)0x46020C00u)
#define GPIOD_S     ((GPIO_TypeDef *)0x56020C00u)
#define GPIOE_NS    ((GPIO_TypeDef *)0x46021000u)
#define GPIOE_S     ((GPIO_TypeDef *)0x56021000u)
#define GPIOF_NS    ((GPIO_TypeDef *)0x46021400u)
#define GPIOF_S     ((GPIO_TypeDef *)0x56021400u)
#define GPIOG_NS    ((GPIO_TypeDef *)0x46021800u)
#define GPIOG_S     ((GPIO_TypeDef *)0x56021800u)
#define GPIOH_NS    ((GPIO_TypeDef *)0x46021C00u)
#define GPIOH_S     ((GPIO_TypeDef *)0x56021C00u)
#define GPIOI_NS    ((GPIO_TypeDef *)0x46022000u)
#define GPIOI_S     ((GPIO_TypeDef *)0x56022000u)
#define GPIOJ_NS    ((GPIO_TypeDef *)0x46022400u)
#define GPIOJ_S     ((GPIO_TypeDef *)0x56022400u)
#define GPIOK_NS    ((GPIO_TypeDef *)0x46022800u)
#define GPIOK_S     ((GPIO_TypeDef *)0x56022800u)
#define GPIOM_NS    ((GPIO_TypeDef *)0x46023000u)
#define GPIOM_S     ((GPIO_TypeDef *)0x56023000u)
#endif

// MODER Configuration

#define GPIO_MODER_MODE15               (0x3u<<30)
#define GPIO_MODER_MODE15_0             (0x1u<<30)
#define GPIO_MODER_MODE14               (0x3u<<28)
#define GPIO_MODER_MODE14_0             (0x1u<<28)
#define GPIO_MODER_MODE13               (0x3u<<26)
#define GPIO_MODER_MODE13_0             (0x1u<<26)
#define GPIO_MODER_MODE12               (0x3u<<24)
#define GPIO_MODER_MODE12_0             (0x1u<<24)
#define GPIO_MODER_MODE11               (0x3u<<22)
#define GPIO_MODER_MODE11_0             (0x1u<<22)
#define GPIO_MODER_MODE10               (0x3u<<20)
#define GPIO_MODER_MODE10_0             (0x1u<<20)
#define GPIO_MODER_MODE9                (0x3u<<18)
#define GPIO_MODER_MODE9_0              (0x1u<<18)
#define GPIO_MODER_MODE8                (0x3u<<16)
#define GPIO_MODER_MODE8_0              (0x1u<<16)
#define GPIO_MODER_MODE7                (0x3u<<14)
#define GPIO_MODER_MODE7_0              (0x1u<<14)
#define GPIO_MODER_MODE6                (0x3u<<12)
#define GPIO_MODER_MODE6_0              (0x1u<<12)
#define GPIO_MODER_MODE5                (0x3u<<10)
#define GPIO_MODER_MODE5_0              (0x1u<<10)
#define GPIO_MODER_MODE4                (0x3u<<8)
#define GPIO_MODER_MODE4_0              (0x1u<<8)
#define GPIO_MODER_MODE3                (0x3u<<6)
#define GPIO_MODER_MODE3_0              (0x1u<<6)
#define GPIO_MODER_MODE2                (0x3u<<4)
#define GPIO_MODER_MODE2_0              (0x1u<<4)
#define GPIO_MODER_MODE1                (0x3u<<2)
#define GPIO_MODER_MODE1_0              (0x1u<<2)
#define GPIO_MODER_MODE0                (0x3u<<0)
#define GPIO_MODER_MODE0_0              (0x1u<<0)

#define GPIO_MODER_MODE15_B_0X0         (0x0u<<30)
#define GPIO_MODER_MODE15_B_0X1         (0x1u<<30)
#define GPIO_MODER_MODE15_B_0X2         (0x2u<<30)
#define GPIO_MODER_MODE15_B_0X3         (0x3u<<30)
#define GPIO_MODER_MODE14_B_0X0         (0x0u<<28)
#define GPIO_MODER_MODE14_B_0X1         (0x1u<<28)
#define GPIO_MODER_MODE14_B_0X2         (0x2u<<28)
#define GPIO_MODER_MODE14_B_0X3         (0x3u<<28)
#define GPIO_MODER_MODE13_B_0X0         (0x0u<<26)
#define GPIO_MODER_MODE13_B_0X1         (0x1u<<26)
#define GPIO_MODER_MODE13_B_0X2         (0x2u<<26)
#define GPIO_MODER_MODE13_B_0X3         (0x3u<<26)
#define GPIO_MODER_MODE12_B_0X0         (0x0u<<24)
#define GPIO_MODER_MODE12_B_0X1         (0x1u<<24)
#define GPIO_MODER_MODE12_B_0X2         (0x2u<<24)
#define GPIO_MODER_MODE12_B_0X3         (0x3u<<24)
#define GPIO_MODER_MODE11_B_0X0         (0x0u<<22)
#define GPIO_MODER_MODE11_B_0X1         (0x1u<<22)
#define GPIO_MODER_MODE11_B_0X2         (0x2u<<22)
#define GPIO_MODER_MODE11_B_0X3         (0x3u<<22)
#define GPIO_MODER_MODE10_B_0X0         (0x0u<<20)
#define GPIO_MODER_MODE10_B_0X1         (0x1u<<20)
#define GPIO_MODER_MODE10_B_0X2         (0x2u<<20)
#define GPIO_MODER_MODE10_B_0X3         (0x3u<<20)
#define GPIO_MODER_MODE9_B_0X0          (0x0u<<18)
#define GPIO_MODER_MODE9_B_0X1          (0x1u<<18)
#define GPIO_MODER_MODE9_B_0X2          (0x2u<<18)
#define GPIO_MODER_MODE9_B_0X3          (0x3u<<18)
#define GPIO_MODER_MODE8_B_0X0          (0x0u<<16)
#define GPIO_MODER_MODE8_B_0X1          (0x1u<<16)
#define GPIO_MODER_MODE8_B_0X2          (0x2u<<16)
#define GPIO_MODER_MODE8_B_0X3          (0x3u<<16)
#define GPIO_MODER_MODE7_B_0X0          (0x0u<<14)
#define GPIO_MODER_MODE7_B_0X1          (0x1u<<14)
#define GPIO_MODER_MODE7_B_0X2          (0x2u<<14)
#define GPIO_MODER_MODE7_B_0X3          (0x3u<<14)
#define GPIO_MODER_MODE6_B_0X0          (0x0u<<12)
#define GPIO_MODER_MODE6_B_0X1          (0x1u<<12)
#define GPIO_MODER_MODE6_B_0X2          (0x2u<<12)
#define GPIO_MODER_MODE6_B_0X3          (0x3u<<12)
#define GPIO_MODER_MODE5_B_0X0          (0x0u<<10)
#define GPIO_MODER_MODE5_B_0X1          (0x1u<<10)
#define GPIO_MODER_MODE5_B_0X2          (0x2u<<10)
#define GPIO_MODER_MODE5_B_0X3          (0x3u<<10)
#define GPIO_MODER_MODE4_B_0X0          (0x0u<<8)
#define GPIO_MODER_MODE4_B_0X1          (0x1u<<8)
#define GPIO_MODER_MODE4_B_0X2          (0x2u<<8)
#define GPIO_MODER_MODE4_B_0X3          (0x3u<<8)
#define GPIO_MODER_MODE3_B_0X0          (0x0u<<6)
#define GPIO_MODER_MODE3_B_0X1          (0x1u<<6)
#define GPIO_MODER_MODE3_B_0X2          (0x2u<<6)
#define GPIO_MODER_MODE3_B_0X3          (0x3u<<6)
#define GPIO_MODER_MODE2_B_0X0          (0x0u<<4)
#define GPIO_MODER_MODE2_B_0X1          (0x1u<<4)
#define GPIO_MODER_MODE2_B_0X2          (0x2u<<4)
#define GPIO_MODER_MODE2_B_0X3          (0x3u<<4)
#define GPIO_MODER_MODE1_B_0X0          (0x0u<<2)
#define GPIO_MODER_MODE1_B_0X1          (0x1u<<2)
#define GPIO_MODER_MODE1_B_0X2          (0x2u<<2)
#define GPIO_MODER_MODE1_B_0X3          (0x3u<<2)
#define GPIO_MODER_MODE0_B_0X0          (0x0u<<0)
#define GPIO_MODER_MODE0_B_0X1          (0x1u<<0)
#define GPIO_MODER_MODE0_B_0X2          (0x2u<<0)
#define GPIO_MODER_MODE0_B_0X3          (0x3u<<0)

// OTYPER Configuration

#define GPIO_OTYPER_OT15                (0x1u<<15)
#define GPIO_OTYPER_OT14                (0x1u<<14)
#define GPIO_OTYPER_OT13                (0x1u<<13)
#define GPIO_OTYPER_OT12                (0x1u<<12)
#define GPIO_OTYPER_OT11                (0x1u<<11)
#define GPIO_OTYPER_OT10                (0x1u<<10)
#define GPIO_OTYPER_OT9                 (0x1u<<9)
#define GPIO_OTYPER_OT8                 (0x1u<<8)
#define GPIO_OTYPER_OT7                 (0x1u<<7)
#define GPIO_OTYPER_OT6                 (0x1u<<6)
#define GPIO_OTYPER_OT5                 (0x1u<<5)
#define GPIO_OTYPER_OT4                 (0x1u<<4)
#define GPIO_OTYPER_OT3                 (0x1u<<3)
#define GPIO_OTYPER_OT2                 (0x1u<<2)
#define GPIO_OTYPER_OT1                 (0x1u<<1)
#define GPIO_OTYPER_OT0                 (0x1u<<0)

#define GPIO_OTYPER_OT15_B_0X0          (0x0u<<15)
#define GPIO_OTYPER_OT15_B_0X1          (0x1u<<15)
#define GPIO_OTYPER_OT14_B_0X0          (0x0u<<14)
#define GPIO_OTYPER_OT14_B_0X1          (0x1u<<14)
#define GPIO_OTYPER_OT13_B_0X0          (0x0u<<13)
#define GPIO_OTYPER_OT13_B_0X1          (0x1u<<13)
#define GPIO_OTYPER_OT12_B_0X0          (0x0u<<12)
#define GPIO_OTYPER_OT12_B_0X1          (0x1u<<12)
#define GPIO_OTYPER_OT11_B_0X0          (0x0u<<11)
#define GPIO_OTYPER_OT11_B_0X1          (0x1u<<11)
#define GPIO_OTYPER_OT10_B_0X0          (0x0u<<10)
#define GPIO_OTYPER_OT10_B_0X1          (0x1u<<10)
#define GPIO_OTYPER_OT9_B_0X0           (0x0u<<9)
#define GPIO_OTYPER_OT9_B_0X1           (0x1u<<9)
#define GPIO_OTYPER_OT8_B_0X0           (0x0u<<8)
#define GPIO_OTYPER_OT8_B_0X1           (0x1u<<8)
#define GPIO_OTYPER_OT7_B_0X0           (0x0u<<7)
#define GPIO_OTYPER_OT7_B_0X1           (0x1u<<7)
#define GPIO_OTYPER_OT6_B_0X0           (0x0u<<6)
#define GPIO_OTYPER_OT6_B_0X1           (0x1u<<6)
#define GPIO_OTYPER_OT5_B_0X0           (0x0u<<5)
#define GPIO_OTYPER_OT5_B_0X1           (0x1u<<5)
#define GPIO_OTYPER_OT4_B_0X0           (0x0u<<4)
#define GPIO_OTYPER_OT4_B_0X1           (0x1u<<4)
#define GPIO_OTYPER_OT3_B_0X0           (0x0u<<3)
#define GPIO_OTYPER_OT3_B_0X1           (0x1u<<3)
#define GPIO_OTYPER_OT2_B_0X0           (0x0u<<2)
#define GPIO_OTYPER_OT2_B_0X1           (0x1u<<2)
#define GPIO_OTYPER_OT1_B_0X0           (0x0u<<1)
#define GPIO_OTYPER_OT1_B_0X1           (0x1u<<1)
#define GPIO_OTYPER_OT0_B_0X0           (0x0u<<0)
#define GPIO_OTYPER_OT0_B_0X1           (0x1u<<0)

// OSPEEDR Configuration

#define GPIO_OSPEEDR_OSPEED15           (0x3u<<30)
#define GPIO_OSPEEDR_OSPEED15_0         (0x1u<<30)
#define GPIO_OSPEEDR_OSPEED14           (0x3u<<28)
#define GPIO_OSPEEDR_OSPEED14_0         (0x1u<<28)
#define GPIO_OSPEEDR_OSPEED13           (0x3u<<26)
#define GPIO_OSPEEDR_OSPEED13_0         (0x1u<<26)
#define GPIO_OSPEEDR_OSPEED12           (0x3u<<24)
#define GPIO_OSPEEDR_OSPEED12_0         (0x1u<<24)
#define GPIO_OSPEEDR_OSPEED11           (0x3u<<22)
#define GPIO_OSPEEDR_OSPEED11_0         (0x1u<<22)
#define GPIO_OSPEEDR_OSPEED10           (0x3u<<20)
#define GPIO_OSPEEDR_OSPEED10_0         (0x1u<<20)
#define GPIO_OSPEEDR_OSPEED9            (0x3u<<18)
#define GPIO_OSPEEDR_OSPEED9_0          (0x1u<<18)
#define GPIO_OSPEEDR_OSPEED8            (0x3u<<16)
#define GPIO_OSPEEDR_OSPEED8_0          (0x1u<<16)
#define GPIO_OSPEEDR_OSPEED7            (0x3u<<14)
#define GPIO_OSPEEDR_OSPEED7_0          (0x1u<<14)
#define GPIO_OSPEEDR_OSPEED6            (0x3u<<12)
#define GPIO_OSPEEDR_OSPEED6_0          (0x1u<<12)
#define GPIO_OSPEEDR_OSPEED5            (0x3u<<10)
#define GPIO_OSPEEDR_OSPEED5_0          (0x1u<<10)
#define GPIO_OSPEEDR_OSPEED4            (0x3u<<8)
#define GPIO_OSPEEDR_OSPEED4_0          (0x1u<<8)
#define GPIO_OSPEEDR_OSPEED3            (0x3u<<6)
#define GPIO_OSPEEDR_OSPEED3_0          (0x1u<<6)
#define GPIO_OSPEEDR_OSPEED2            (0x3u<<4)
#define GPIO_OSPEEDR_OSPEED2_0          (0x1u<<4)
#define GPIO_OSPEEDR_OSPEED1            (0x3u<<2)
#define GPIO_OSPEEDR_OSPEED1_0          (0x1u<<2)
#define GPIO_OSPEEDR_OSPEED0            (0x3u<<0)
#define GPIO_OSPEEDR_OSPEED0_0          (0x1u<<0)

#define GPIO_OSPEEDR_OSPEED15_B_0X0     (0x0u<<30)
#define GPIO_OSPEEDR_OSPEED15_B_0X1     (0x1u<<30)
#define GPIO_OSPEEDR_OSPEED15_B_0X2     (0x2u<<30)
#define GPIO_OSPEEDR_OSPEED15_B_0X3     (0x3u<<30)
#define GPIO_OSPEEDR_OSPEED14_B_0X0     (0x0u<<28)
#define GPIO_OSPEEDR_OSPEED14_B_0X1     (0x1u<<28)
#define GPIO_OSPEEDR_OSPEED14_B_0X2     (0x2u<<28)
#define GPIO_OSPEEDR_OSPEED14_B_0X3     (0x3u<<28)
#define GPIO_OSPEEDR_OSPEED13_B_0X0     (0x0u<<26)
#define GPIO_OSPEEDR_OSPEED13_B_0X1     (0x1u<<26)
#define GPIO_OSPEEDR_OSPEED13_B_0X2     (0x2u<<26)
#define GPIO_OSPEEDR_OSPEED13_B_0X3     (0x3u<<26)
#define GPIO_OSPEEDR_OSPEED12_B_0X0     (0x0u<<24)
#define GPIO_OSPEEDR_OSPEED12_B_0X1     (0x1u<<24)
#define GPIO_OSPEEDR_OSPEED12_B_0X2     (0x2u<<24)
#define GPIO_OSPEEDR_OSPEED12_B_0X3     (0x3u<<24)
#define GPIO_OSPEEDR_OSPEED11_B_0X0     (0x0u<<22)
#define GPIO_OSPEEDR_OSPEED11_B_0X1     (0x1u<<22)
#define GPIO_OSPEEDR_OSPEED11_B_0X2     (0x2u<<22)
#define GPIO_OSPEEDR_OSPEED11_B_0X3     (0x3u<<22)
#define GPIO_OSPEEDR_OSPEED10_B_0X0     (0x0u<<20)
#define GPIO_OSPEEDR_OSPEED10_B_0X1     (0x1u<<20)
#define GPIO_OSPEEDR_OSPEED10_B_0X2     (0x2u<<20)
#define GPIO_OSPEEDR_OSPEED10_B_0X3     (0x3u<<20)
#define GPIO_OSPEEDR_OSPEED9_B_0X0      (0x0u<<18)
#define GPIO_OSPEEDR_OSPEED9_B_0X1      (0x1u<<18)
#define GPIO_OSPEEDR_OSPEED9_B_0X2      (0x2u<<18)
#define GPIO_OSPEEDR_OSPEED9_B_0X3      (0x3u<<18)
#define GPIO_OSPEEDR_OSPEED8_B_0X0      (0x0u<<16)
#define GPIO_OSPEEDR_OSPEED8_B_0X1      (0x1u<<16)
#define GPIO_OSPEEDR_OSPEED8_B_0X2      (0x2u<<16)
#define GPIO_OSPEEDR_OSPEED8_B_0X3      (0x3u<<16)
#define GPIO_OSPEEDR_OSPEED7_B_0X0      (0x0u<<14)
#define GPIO_OSPEEDR_OSPEED7_B_0X1      (0x1u<<14)
#define GPIO_OSPEEDR_OSPEED7_B_0X2      (0x2u<<14)
#define GPIO_OSPEEDR_OSPEED7_B_0X3      (0x3u<<14)
#define GPIO_OSPEEDR_OSPEED6_B_0X0      (0x0u<<12)
#define GPIO_OSPEEDR_OSPEED6_B_0X1      (0x1u<<12)
#define GPIO_OSPEEDR_OSPEED6_B_0X2      (0x2u<<12)
#define GPIO_OSPEEDR_OSPEED6_B_0X3      (0x3u<<12)
#define GPIO_OSPEEDR_OSPEED5_B_0X0      (0x0u<<10)
#define GPIO_OSPEEDR_OSPEED5_B_0X1      (0x1u<<10)
#define GPIO_OSPEEDR_OSPEED5_B_0X2      (0x2u<<10)
#define GPIO_OSPEEDR_OSPEED5_B_0X3      (0x3u<<10)
#define GPIO_OSPEEDR_OSPEED4_B_0X0      (0x0u<<8)
#define GPIO_OSPEEDR_OSPEED4_B_0X1      (0x1u<<8)
#define GPIO_OSPEEDR_OSPEED4_B_0X2      (0x2u<<8)
#define GPIO_OSPEEDR_OSPEED4_B_0X3      (0x3u<<8)
#define GPIO_OSPEEDR_OSPEED3_B_0X0      (0x0u<<6)
#define GPIO_OSPEEDR_OSPEED3_B_0X1      (0x1u<<6)
#define GPIO_OSPEEDR_OSPEED3_B_0X2      (0x2u<<6)
#define GPIO_OSPEEDR_OSPEED3_B_0X3      (0x3u<<6)
#define GPIO_OSPEEDR_OSPEED2_B_0X0      (0x0u<<4)
#define GPIO_OSPEEDR_OSPEED2_B_0X1      (0x1u<<4)
#define GPIO_OSPEEDR_OSPEED2_B_0X2      (0x2u<<4)
#define GPIO_OSPEEDR_OSPEED2_B_0X3      (0x3u<<4)
#define GPIO_OSPEEDR_OSPEED1_B_0X0      (0x0u<<2)
#define GPIO_OSPEEDR_OSPEED1_B_0X1      (0x1u<<2)
#define GPIO_OSPEEDR_OSPEED1_B_0X2      (0x2u<<2)
#define GPIO_OSPEEDR_OSPEED1_B_0X3      (0x3u<<2)
#define GPIO_OSPEEDR_OSPEED0_B_0X0      (0x0u<<0)
#define GPIO_OSPEEDR_OSPEED0_B_0X1      (0x1u<<0)
#define GPIO_OSPEEDR_OSPEED0_B_0X2      (0x2u<<0)
#define GPIO_OSPEEDR_OSPEED0_B_0X3      (0x3u<<0)

