Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpio.h
// PUPDR Configuration

#define GPIO_PUPDR_PUPD15               (0x3u<<30)
#define GPIO_PUPDR_PUPD15_0             (0x1u<<30)
#define GPIO_PUPDR_PUPD14               (0x3u<<28)
#define GPIO_PUPDR_PUPD14_0             (0x1u<<28)
#define GPIO_PUPDR_PUPD13               (0x3u<<26)
#define GPIO_PUPDR_PUPD13_0             (0x1u<<26)
#define GPIO_PUPDR_PUPD12               (0x3u<<24)
#define GPIO_PUPDR_PUPD12_0             (0x1u<<24)
#define GPIO_PUPDR_PUPD11               (0x3u<<22)
#define GPIO_PUPDR_PUPD11_0             (0x1u<<22)
#define GPIO_PUPDR_PUPD10               (0x3u<<20)
#define GPIO_PUPDR_PUPD10_0             (0x1u<<20)
#define GPIO_PUPDR_PUPD9                (0x3u<<18)
#define GPIO_PUPDR_PUPD9_0              (0x1u<<18)
#define GPIO_PUPDR_PUPD8                (0x3u<<16)
#define GPIO_PUPDR_PUPD8_0              (0x1u<<16)
#define GPIO_PUPDR_PUPD7                (0x3u<<14)
#define GPIO_PUPDR_PUPD7_0              (0x1u<<14)
#define GPIO_PUPDR_PUPD6                (0x3u<<12)
#define GPIO_PUPDR_PUPD6_0              (0x1u<<12)
#define GPIO_PUPDR_PUPD5                (0x3u<<10)
#define GPIO_PUPDR_PUPD5_0              (0x1u<<10)
#define GPIO_PUPDR_PUPD4                (0x3u<<8)
#define GPIO_PUPDR_PUPD4_0              (0x1u<<8)
#define GPIO_PUPDR_PUPD3                (0x3u<<6)
#define GPIO_PUPDR_PUPD3_0              (0x1u<<6)
#define GPIO_PUPDR_PUPD2                (0x3u<<4)
#define GPIO_PUPDR_PUPD2_0              (0x1u<<4)
#define GPIO_PUPDR_PUPD1                (0x3u<<2)
#define GPIO_PUPDR_PUPD1_0              (0x1u<<2)
#define GPIO_PUPDR_PUPD0                (0x3u<<0)
#define GPIO_PUPDR_PUPD0_0              (0x1u<<0)

#define GPIO_PUPDR_PUPD15_B_0X0         (0x0u<<30)
#define GPIO_PUPDR_PUPD15_B_0X1         (0x1u<<30)
#define GPIO_PUPDR_PUPD15_B_0X2         (0x2u<<30)
#define GPIO_PUPDR_PUPD14_B_0X0         (0x0u<<28)
#define GPIO_PUPDR_PUPD14_B_0X1         (0x1u<<28)
#define GPIO_PUPDR_PUPD14_B_0X2         (0x2u<<28)
#define GPIO_PUPDR_PUPD13_B_0X0         (0x0u<<26)
#define GPIO_PUPDR_PUPD13_B_0X1         (0x1u<<26)
#define GPIO_PUPDR_PUPD13_B_0X2         (0x2u<<26)
#define GPIO_PUPDR_PUPD12_B_0X0         (0x0u<<24)
#define GPIO_PUPDR_PUPD12_B_0X1         (0x1u<<24)
#define GPIO_PUPDR_PUPD12_B_0X2         (0x2u<<24)
#define GPIO_PUPDR_PUPD11_B_0X0         (0x0u<<22)
#define GPIO_PUPDR_PUPD11_B_0X1         (0x1u<<22)
#define GPIO_PUPDR_PUPD11_B_0X2         (0x2u<<22)
#define GPIO_PUPDR_PUPD10_B_0X0         (0x0u<<20)
#define GPIO_PUPDR_PUPD10_B_0X1         (0x1u<<20)
#define GPIO_PUPDR_PUPD10_B_0X2         (0x2u<<20)
#define GPIO_PUPDR_PUPD9_B_0X0          (0x0u<<18)
#define GPIO_PUPDR_PUPD9_B_0X1          (0x1u<<18)
#define GPIO_PUPDR_PUPD9_B_0X2          (0x2u<<18)
#define GPIO_PUPDR_PUPD8_B_0X0          (0x0u<<16)
#define GPIO_PUPDR_PUPD8_B_0X1          (0x1u<<16)
#define GPIO_PUPDR_PUPD8_B_0X2          (0x2u<<16)
#define GPIO_PUPDR_PUPD7_B_0X0          (0x0u<<14)
#define GPIO_PUPDR_PUPD7_B_0X1          (0x1u<<14)
#define GPIO_PUPDR_PUPD7_B_0X2          (0x2u<<14)
#define GPIO_PUPDR_PUPD6_B_0X0          (0x0u<<12)
#define GPIO_PUPDR_PUPD6_B_0X1          (0x1u<<12)
#define GPIO_PUPDR_PUPD6_B_0X2          (0x2u<<12)
#define GPIO_PUPDR_PUPD5_B_0X0          (0x0u<<10)
#define GPIO_PUPDR_PUPD5_B_0X1          (0x1u<<10)
#define GPIO_PUPDR_PUPD5_B_0X2          (0x2u<<10)
#define GPIO_PUPDR_PUPD4_B_0X0          (0x0u<<8)
#define GPIO_PUPDR_PUPD4_B_0X1          (0x1u<<8)
#define GPIO_PUPDR_PUPD4_B_0X2          (0x2u<<8)
#define GPIO_PUPDR_PUPD3_B_0X0          (0x0u<<6)
#define GPIO_PUPDR_PUPD3_B_0X1          (0x1u<<6)
#define GPIO_PUPDR_PUPD3_B_0X2          (0x2u<<6)
#define GPIO_PUPDR_PUPD2_B_0X0          (0x0u<<4)
#define GPIO_PUPDR_PUPD2_B_0X1          (0x1u<<4)
#define GPIO_PUPDR_PUPD2_B_0X2          (0x2u<<4)
#define GPIO_PUPDR_PUPD1_B_0X0          (0x0u<<2)
#define GPIO_PUPDR_PUPD1_B_0X1          (0x1u<<2)
#define GPIO_PUPDR_PUPD1_B_0X2          (0x2u<<2)
#define GPIO_PUPDR_PUPD0_B_0X0          (0x0u<<0)
#define GPIO_PUPDR_PUPD0_B_0X1          (0x1u<<0)
#define GPIO_PUPDR_PUPD0_B_0X2          (0x2u<<0)

// IDR Configuration

#define GPIO_IDR_ID15                   (0x1u<<15)
#define GPIO_IDR_ID14                   (0x1u<<14)
#define GPIO_IDR_ID13                   (0x1u<<13)
#define GPIO_IDR_ID12                   (0x1u<<12)
#define GPIO_IDR_ID11                   (0x1u<<11)
#define GPIO_IDR_ID10                   (0x1u<<10)
#define GPIO_IDR_ID9                    (0x1u<<9)
#define GPIO_IDR_ID8                    (0x1u<<8)
#define GPIO_IDR_ID7                    (0x1u<<7)
#define GPIO_IDR_ID6                    (0x1u<<6)
#define GPIO_IDR_ID5                    (0x1u<<5)
#define GPIO_IDR_ID4                    (0x1u<<4)
#define GPIO_IDR_ID3                    (0x1u<<3)
#define GPIO_IDR_ID2                    (0x1u<<2)
#define GPIO_IDR_ID1                    (0x1u<<1)
#define GPIO_IDR_ID0                    (0x1u<<0)

// ODR Configuration

#define GPIO_ODR_OD15                   (0x1u<<15)
#define GPIO_ODR_OD14                   (0x1u<<14)
#define GPIO_ODR_OD13                   (0x1u<<13)
#define GPIO_ODR_OD12                   (0x1u<<12)
#define GPIO_ODR_OD11                   (0x1u<<11)
#define GPIO_ODR_OD10                   (0x1u<<10)
#define GPIO_ODR_OD9                    (0x1u<<9)
#define GPIO_ODR_OD8                    (0x1u<<8)
#define GPIO_ODR_OD7                    (0x1u<<7)
#define GPIO_ODR_OD6                    (0x1u<<6)
#define GPIO_ODR_OD5                    (0x1u<<5)
#define GPIO_ODR_OD4                    (0x1u<<4)
#define GPIO_ODR_OD3                    (0x1u<<3)
#define GPIO_ODR_OD2                    (0x1u<<2)
#define GPIO_ODR_OD1                    (0x1u<<1)
#define GPIO_ODR_OD0                    (0x1u<<0)

// BSRR Configuration

#define GPIO_BSRR_BR15                  (0x1u<<31)
#define GPIO_BSRR_BR14                  (0x1u<<30)
#define GPIO_BSRR_BR13                  (0x1u<<29)
#define GPIO_BSRR_BR12                  (0x1u<<28)
#define GPIO_BSRR_BR11                  (0x1u<<27)
#define GPIO_BSRR_BR10                  (0x1u<<26)
#define GPIO_BSRR_BR9                   (0x1u<<25)
#define GPIO_BSRR_BR8                   (0x1u<<24)
#define GPIO_BSRR_BR7                   (0x1u<<23)
#define GPIO_BSRR_BR6                   (0x1u<<22)
#define GPIO_BSRR_BR5                   (0x1u<<21)
#define GPIO_BSRR_BR4                   (0x1u<<20)
#define GPIO_BSRR_BR3                   (0x1u<<19)
#define GPIO_BSRR_BR2                   (0x1u<<18)
#define GPIO_BSRR_BR1                   (0x1u<<17)
#define GPIO_BSRR_BR0                   (0x1u<<16)
#define GPIO_BSRR_BS15                  (0x1u<<15)
#define GPIO_BSRR_BS14                  (0x1u<<14)
#define GPIO_BSRR_BS13                  (0x1u<<13)
#define GPIO_BSRR_BS12                  (0x1u<<12)
#define GPIO_BSRR_BS11                  (0x1u<<11)
#define GPIO_BSRR_BS10                  (0x1u<<10)
#define GPIO_BSRR_BS9                   (0x1u<<9)
#define GPIO_BSRR_BS8                   (0x1u<<8)
#define GPIO_BSRR_BS7                   (0x1u<<7)
#define GPIO_BSRR_BS6                   (0x1u<<6)
#define GPIO_BSRR_BS5                   (0x1u<<5)
#define GPIO_BSRR_BS4                   (0x1u<<4)
#define GPIO_BSRR_BS3                   (0x1u<<3)
#define GPIO_BSRR_BS2                   (0x1u<<2)
#define GPIO_BSRR_BS1                   (0x1u<<1)
#define GPIO_BSRR_BS0                   (0x1u<<0)

#define GPIO_BSRR_BR15_B_0X0            (0x0u<<31)
#define GPIO_BSRR_BR15_B_0X1            (0x1u<<31)
#define GPIO_BSRR_BR14_B_0X0            (0x0u<<30)
#define GPIO_BSRR_BR14_B_0X1            (0x1u<<30)
#define GPIO_BSRR_BR13_B_0X0            (0x0u<<29)
#define GPIO_BSRR_BR13_B_0X1            (0x1u<<29)
#define GPIO_BSRR_BR12_B_0X0            (0x0u<<28)
#define GPIO_BSRR_BR12_B_0X1            (0x1u<<28)
#define GPIO_BSRR_BR11_B_0X0            (0x0u<<27)
#define GPIO_BSRR_BR11_B_0X1            (0x1u<<27)
#define GPIO_BSRR_BR10_B_0X0            (0x0u<<26)
#define GPIO_BSRR_BR10_B_0X1            (0x1u<<26)
#define GPIO_BSRR_BR9_B_0X0             (0x0u<<25)
#define GPIO_BSRR_BR9_B_0X1             (0x1u<<25)
#define GPIO_BSRR_BR8_B_0X0             (0x0u<<24)
#define GPIO_BSRR_BR8_B_0X1             (0x1u<<24)
#define GPIO_BSRR_BR7_B_0X0             (0x0u<<23)
#define GPIO_BSRR_BR7_B_0X1             (0x1u<<23)
#define GPIO_BSRR_BR6_B_0X0             (0x0u<<22)
#define GPIO_BSRR_BR6_B_0X1             (0x1u<<22)
#define GPIO_BSRR_BR5_B_0X0             (0x0u<<21)
#define GPIO_BSRR_BR5_B_0X1             (0x1u<<21)
#define GPIO_BSRR_BR4_B_0X0             (0x0u<<20)
#define GPIO_BSRR_BR4_B_0X1             (0x1u<<20)
#define GPIO_BSRR_BR3_B_0X0             (0x0u<<19)
#define GPIO_BSRR_BR3_B_0X1             (0x1u<<19)
#define GPIO_BSRR_BR2_B_0X0             (0x0u<<18)
#define GPIO_BSRR_BR2_B_0X1             (0x1u<<18)
#define GPIO_BSRR_BR1_B_0X0             (0x0u<<17)
#define GPIO_BSRR_BR1_B_0X1             (0x1u<<17)
#define GPIO_BSRR_BR0_B_0X0             (0x0u<<16)
#define GPIO_BSRR_BR0_B_0X1             (0x1u<<16)
#define GPIO_BSRR_BS15_B_0X0            (0x0u<<15)
#define GPIO_BSRR_BS15_B_0X1            (0x1u<<15)
#define GPIO_BSRR_BS14_B_0X0            (0x0u<<14)
#define GPIO_BSRR_BS14_B_0X1            (0x1u<<14)
#define GPIO_BSRR_BS13_B_0X0            (0x0u<<13)
#define GPIO_BSRR_BS13_B_0X1            (0x1u<<13)
#define GPIO_BSRR_BS12_B_0X0            (0x0u<<12)
#define GPIO_BSRR_BS12_B_0X1            (0x1u<<12)
#define GPIO_BSRR_BS11_B_0X0            (0x0u<<11)
#define GPIO_BSRR_BS11_B_0X1            (0x1u<<11)
#define GPIO_BSRR_BS10_B_0X0            (0x0u<<10)
#define GPIO_BSRR_BS10_B_0X1            (0x1u<<10)
#define GPIO_BSRR_BS9_B_0X0             (0x0u<<9)
#define GPIO_BSRR_BS9_B_0X1             (0x1u<<9)
#define GPIO_BSRR_BS8_B_0X0             (0x0u<<8)
#define GPIO_BSRR_BS8_B_0X1             (0x1u<<8)
#define GPIO_BSRR_BS7_B_0X0             (0x0u<<7)
#define GPIO_BSRR_BS7_B_0X1             (0x1u<<7)
#define GPIO_BSRR_BS6_B_0X0             (0x0u<<6)
#define GPIO_BSRR_BS6_B_0X1             (0x1u<<6)
#define GPIO_BSRR_BS5_B_0X0             (0x0u<<5)
#define GPIO_BSRR_BS5_B_0X1             (0x1u<<5)
#define GPIO_BSRR_BS4_B_0X0             (0x0u<<4)
#define GPIO_BSRR_BS4_B_0X1             (0x1u<<4)
#define GPIO_BSRR_BS3_B_0X0             (0x0u<<3)
#define GPIO_BSRR_BS3_B_0X1             (0x1u<<3)
#define GPIO_BSRR_BS2_B_0X0             (0x0u<<2)
#define GPIO_BSRR_BS2_B_0X1             (0x1u<<2)
#define GPIO_BSRR_BS1_B_0X0             (0x0u<<1)
#define GPIO_BSRR_BS1_B_0X1             (0x1u<<1)
#define GPIO_BSRR_BS0_B_0X0             (0x0u<<0)
#define GPIO_BSRR_BS0_B_0X1             (0x1u<<0)

// LCKR Configuration

#define GPIO_LCKR_LCKK                  (0x1u<<16)
#define GPIO_LCKR_LCK15                 (0x1u<<15)
#define GPIO_LCKR_LCK14                 (0x1u<<14)
#define GPIO_LCKR_LCK13                 (0x1u<<13)
#define GPIO_LCKR_LCK12                 (0x1u<<12)
#define GPIO_LCKR_LCK11                 (0x1u<<11)
#define GPIO_LCKR_LCK10                 (0x1u<<10)
#define GPIO_LCKR_LCK9                  (0x1u<<9)
#define GPIO_LCKR_LCK8                  (0x1u<<8)
#define GPIO_LCKR_LCK7                  (0x1u<<7)
#define GPIO_LCKR_LCK6                  (0x1u<<6)
#define GPIO_LCKR_LCK5                  (0x1u<<5)
#define GPIO_LCKR_LCK4                  (0x1u<<4)
#define GPIO_LCKR_LCK3                  (0x1u<<3)
#define GPIO_LCKR_LCK2                  (0x1u<<2)
#define GPIO_LCKR_LCK1                  (0x1u<<1)
#define GPIO_LCKR_LCK0                  (0x1u<<0)

#define GPIO_LCKR_LCKK_B_0X0            (0x0u<<16)
#define GPIO_LCKR_LCKK_B_0X1            (0x1u<<16)
#define GPIO_LCKR_LCK15_B_0X0           (0x0u<<15)
#define GPIO_LCKR_LCK15_B_0X1           (0x1u<<15)
#define GPIO_LCKR_LCK14_B_0X0           (0x0u<<14)
#define GPIO_LCKR_LCK14_B_0X1           (0x1u<<14)
#define GPIO_LCKR_LCK13_B_0X0           (0x0u<<13)
#define GPIO_LCKR_LCK13_B_0X1           (0x1u<<13)
#define GPIO_LCKR_LCK12_B_0X0           (0x0u<<12)
#define GPIO_LCKR_LCK12_B_0X1           (0x1u<<12)
#define GPIO_LCKR_LCK11_B_0X0           (0x0u<<11)
#define GPIO_LCKR_LCK11_B_0X1           (0x1u<<11)
#define GPIO_LCKR_LCK10_B_0X0           (0x0u<<10)
#define GPIO_LCKR_LCK10_B_0X1           (0x1u<<10)
#define GPIO_LCKR_LCK9_B_0X0            (0x0u<<9)
#define GPIO_LCKR_LCK9_B_0X1            (0x1u<<9)
#define GPIO_LCKR_LCK8_B_0X0            (0x0u<<8)
#define GPIO_LCKR_LCK8_B_0X1            (0x1u<<8)
#define GPIO_LCKR_LCK7_B_0X0            (0x0u<<7)
#define GPIO_LCKR_LCK7_B_0X1            (0x1u<<7)
#define GPIO_LCKR_LCK6_B_0X0            (0x0u<<6)
#define GPIO_LCKR_LCK6_B_0X1            (0x1u<<6)
#define GPIO_LCKR_LCK5_B_0X0            (0x0u<<5)
#define GPIO_LCKR_LCK5_B_0X1            (0x1u<<5)
#define GPIO_LCKR_LCK4_B_0X0            (0x0u<<4)
#define GPIO_LCKR_LCK4_B_0X1            (0x1u<<4)
#define GPIO_LCKR_LCK3_B_0X0            (0x0u<<3)
#define GPIO_LCKR_LCK3_B_0X1            (0x1u<<3)
#define GPIO_LCKR_LCK2_B_0X0            (0x0u<<2)
#define GPIO_LCKR_LCK2_B_0X1            (0x1u<<2)
#define GPIO_LCKR_LCK1_B_0X0            (0x0u<<1)
#define GPIO_LCKR_LCK1_B_0X1            (0x1u<<1)
#define GPIO_LCKR_LCK0_B_0X0            (0x0u<<0)
#define GPIO_LCKR_LCK0_B_0X1            (0x1u<<0)

