Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpio.h
// AFRL Configuration

#define GPIO_AFRL_AFSEL7                (0xFu<<28)
#define GPIO_AFRL_AFSEL7_0              (0x1u<<28)
#define GPIO_AFRL_AFSEL6                (0xFu<<24)
#define GPIO_AFRL_AFSEL6_0              (0x1u<<24)
#define GPIO_AFRL_AFSEL5                (0xFu<<20)
#define GPIO_AFRL_AFSEL5_0              (0x1u<<20)
#define GPIO_AFRL_AFSEL4                (0xFu<<16)
#define GPIO_AFRL_AFSEL4_0              (0x1u<<16)
#define GPIO_AFRL_AFSEL3                (0xFu<<12)
#define GPIO_AFRL_AFSEL3_0              (0x1u<<12)
#define GPIO_AFRL_AFSEL2                (0xFu<<8)
#define GPIO_AFRL_AFSEL2_0              (0x1u<<8)
#define GPIO_AFRL_AFSEL1                (0xFu<<4)
#define GPIO_AFRL_AFSEL1_0              (0x1u<<4)
#define GPIO_AFRL_AFSEL0                (0xFu<<0)
#define GPIO_AFRL_AFSEL0_0              (0x1u<<0)

#define GPIO_AFRL_AFSEL7_B_0X0          (0x0u<<28)
#define GPIO_AFRL_AFSEL7_B_0X1          (0x1u<<28)
#define GPIO_AFRL_AFSEL7_B_0X2          (0x2u<<28)
#define GPIO_AFRL_AFSEL7_B_0X3          (0x3u<<28)
#define GPIO_AFRL_AFSEL7_B_0X4          (0x4u<<28)
#define GPIO_AFRL_AFSEL7_B_0X5          (0x5u<<28)
#define GPIO_AFRL_AFSEL7_B_0X6          (0x6u<<28)
#define GPIO_AFRL_AFSEL7_B_0X7          (0x7u<<28)
#define GPIO_AFRL_AFSEL7_B_0X8          (0x8u<<28)
#define GPIO_AFRL_AFSEL7_B_0X9          (0x9u<<28)
#define GPIO_AFRL_AFSEL7_B_0XA          (0xAu<<28)
#define GPIO_AFRL_AFSEL7_B_0XB          (0xBu<<28)
#define GPIO_AFRL_AFSEL7_B_0XC          (0xCu<<28)
#define GPIO_AFRL_AFSEL7_B_0XD          (0xDu<<28)
#define GPIO_AFRL_AFSEL7_B_0XE          (0xEu<<28)
#define GPIO_AFRL_AFSEL7_B_0XF          (0xFu<<28)
#define GPIO_AFRL_AFSEL6_B_0X0          (0x0u<<24)
#define GPIO_AFRL_AFSEL6_B_0X1          (0x1u<<24)
#define GPIO_AFRL_AFSEL6_B_0X2          (0x2u<<24)
#define GPIO_AFRL_AFSEL6_B_0X3          (0x3u<<24)
#define GPIO_AFRL_AFSEL6_B_0X4          (0x4u<<24)
#define GPIO_AFRL_AFSEL6_B_0X5          (0x5u<<24)
#define GPIO_AFRL_AFSEL6_B_0X6          (0x6u<<24)
#define GPIO_AFRL_AFSEL6_B_0X7          (0x7u<<24)
#define GPIO_AFRL_AFSEL6_B_0X8          (0x8u<<24)
#define GPIO_AFRL_AFSEL6_B_0X9          (0x9u<<24)
#define GPIO_AFRL_AFSEL6_B_0XA          (0xAu<<24)
#define GPIO_AFRL_AFSEL6_B_0XB          (0xBu<<24)
#define GPIO_AFRL_AFSEL6_B_0XC          (0xCu<<24)
#define GPIO_AFRL_AFSEL6_B_0XD          (0xDu<<24)
#define GPIO_AFRL_AFSEL6_B_0XE          (0xEu<<24)
#define GPIO_AFRL_AFSEL6_B_0XF          (0xFu<<24)
#define GPIO_AFRL_AFSEL5_B_0X0          (0x0u<<20)
#define GPIO_AFRL_AFSEL5_B_0X1          (0x1u<<20)
#define GPIO_AFRL_AFSEL5_B_0X2          (0x2u<<20)
#define GPIO_AFRL_AFSEL5_B_0X3          (0x3u<<20)
#define GPIO_AFRL_AFSEL5_B_0X4          (0x4u<<20)
#define GPIO_AFRL_AFSEL5_B_0X5          (0x5u<<20)
#define GPIO_AFRL_AFSEL5_B_0X6          (0x6u<<20)
#define GPIO_AFRL_AFSEL5_B_0X7          (0x7u<<20)
#define GPIO_AFRL_AFSEL5_B_0X8          (0x8u<<20)
#define GPIO_AFRL_AFSEL5_B_0X9          (0x9u<<20)
#define GPIO_AFRL_AFSEL5_B_0XA          (0xAu<<20)
#define GPIO_AFRL_AFSEL5_B_0XB          (0xBu<<20)
#define GPIO_AFRL_AFSEL5_B_0XC          (0xCu<<20)
#define GPIO_AFRL_AFSEL5_B_0XD          (0xDu<<20)
#define GPIO_AFRL_AFSEL5_B_0XE          (0xEu<<20)
#define GPIO_AFRL_AFSEL5_B_0XF          (0xFu<<20)
#define GPIO_AFRL_AFSEL4_B_0X0          (0x0u<<16)
#define GPIO_AFRL_AFSEL4_B_0X1          (0x1u<<16)
#define GPIO_AFRL_AFSEL4_B_0X2          (0x2u<<16)
#define GPIO_AFRL_AFSEL4_B_0X3          (0x3u<<16)
#define GPIO_AFRL_AFSEL4_B_0X4          (0x4u<<16)
#define GPIO_AFRL_AFSEL4_B_0X5          (0x5u<<16)
#define GPIO_AFRL_AFSEL4_B_0X6          (0x6u<<16)
#define GPIO_AFRL_AFSEL4_B_0X7          (0x7u<<16)
#define GPIO_AFRL_AFSEL4_B_0X8          (0x8u<<16)
#define GPIO_AFRL_AFSEL4_B_0X9          (0x9u<<16)
#define GPIO_AFRL_AFSEL4_B_0XA          (0xAu<<16)
#define GPIO_AFRL_AFSEL4_B_0XB          (0xBu<<16)
#define GPIO_AFRL_AFSEL4_B_0XC          (0xCu<<16)
#define GPIO_AFRL_AFSEL4_B_0XD          (0xDu<<16)
#define GPIO_AFRL_AFSEL4_B_0XE          (0xEu<<16)
#define GPIO_AFRL_AFSEL4_B_0XF          (0xFu<<16)
#define GPIO_AFRL_AFSEL3_B_0X0          (0x0u<<12)
#define GPIO_AFRL_AFSEL3_B_0X1          (0x1u<<12)
#define GPIO_AFRL_AFSEL3_B_0X2          (0x2u<<12)
#define GPIO_AFRL_AFSEL3_B_0X3          (0x3u<<12)
#define GPIO_AFRL_AFSEL3_B_0X4          (0x4u<<12)
#define GPIO_AFRL_AFSEL3_B_0X5          (0x5u<<12)
#define GPIO_AFRL_AFSEL3_B_0X6          (0x6u<<12)
#define GPIO_AFRL_AFSEL3_B_0X7          (0x7u<<12)
#define GPIO_AFRL_AFSEL3_B_0X8          (0x8u<<12)
#define GPIO_AFRL_AFSEL3_B_0X9          (0x9u<<12)
#define GPIO_AFRL_AFSEL3_B_0XA          (0xAu<<12)
#define GPIO_AFRL_AFSEL3_B_0XB          (0xBu<<12)
#define GPIO_AFRL_AFSEL3_B_0XC          (0xCu<<12)
#define GPIO_AFRL_AFSEL3_B_0XD          (0xDu<<12)
#define GPIO_AFRL_AFSEL3_B_0XE          (0xEu<<12)
#define GPIO_AFRL_AFSEL3_B_0XF          (0xFu<<12)
#define GPIO_AFRL_AFSEL2_B_0X0          (0x0u<<8)
#define GPIO_AFRL_AFSEL2_B_0X1          (0x1u<<8)
#define GPIO_AFRL_AFSEL2_B_0X2          (0x2u<<8)
#define GPIO_AFRL_AFSEL2_B_0X3          (0x3u<<8)
#define GPIO_AFRL_AFSEL2_B_0X4          (0x4u<<8)
#define GPIO_AFRL_AFSEL2_B_0X5          (0x5u<<8)
#define GPIO_AFRL_AFSEL2_B_0X6          (0x6u<<8)
#define GPIO_AFRL_AFSEL2_B_0X7          (0x7u<<8)
#define GPIO_AFRL_AFSEL2_B_0X8          (0x8u<<8)
#define GPIO_AFRL_AFSEL2_B_0X9          (0x9u<<8)
#define GPIO_AFRL_AFSEL2_B_0XA          (0xAu<<8)
#define GPIO_AFRL_AFSEL2_B_0XB          (0xBu<<8)
#define GPIO_AFRL_AFSEL2_B_0XC          (0xCu<<8)
#define GPIO_AFRL_AFSEL2_B_0XD          (0xDu<<8)
#define GPIO_AFRL_AFSEL2_B_0XE          (0xEu<<8)
#define GPIO_AFRL_AFSEL2_B_0XF          (0xFu<<8)
#define GPIO_AFRL_AFSEL1_B_0X0          (0x0u<<4)
#define GPIO_AFRL_AFSEL1_B_0X1          (0x1u<<4)
#define GPIO_AFRL_AFSEL1_B_0X2          (0x2u<<4)
#define GPIO_AFRL_AFSEL1_B_0X3          (0x3u<<4)
#define GPIO_AFRL_AFSEL1_B_0X4          (0x4u<<4)
#define GPIO_AFRL_AFSEL1_B_0X5          (0x5u<<4)
#define GPIO_AFRL_AFSEL1_B_0X6          (0x6u<<4)
#define GPIO_AFRL_AFSEL1_B_0X7          (0x7u<<4)
#define GPIO_AFRL_AFSEL1_B_0X8          (0x8u<<4)
#define GPIO_AFRL_AFSEL1_B_0X9          (0x9u<<4)
#define GPIO_AFRL_AFSEL1_B_0XA          (0xAu<<4)
#define GPIO_AFRL_AFSEL1_B_0XB          (0xBu<<4)
#define GPIO_AFRL_AFSEL1_B_0XC          (0xCu<<4)
#define GPIO_AFRL_AFSEL1_B_0XD          (0xDu<<4)
#define GPIO_AFRL_AFSEL1_B_0XE          (0xEu<<4)
#define GPIO_AFRL_AFSEL1_B_0XF          (0xFu<<4)
#define GPIO_AFRL_AFSEL0_B_0X0          (0x0u<<0)
#define GPIO_AFRL_AFSEL0_B_0X1          (0x1u<<0)
#define GPIO_AFRL_AFSEL0_B_0X2          (0x2u<<0)
#define GPIO_AFRL_AFSEL0_B_0X3          (0x3u<<0)
#define GPIO_AFRL_AFSEL0_B_0X4          (0x4u<<0)
#define GPIO_AFRL_AFSEL0_B_0X5          (0x5u<<0)
#define GPIO_AFRL_AFSEL0_B_0X6          (0x6u<<0)
#define GPIO_AFRL_AFSEL0_B_0X7          (0x7u<<0)
#define GPIO_AFRL_AFSEL0_B_0X8          (0x8u<<0)
#define GPIO_AFRL_AFSEL0_B_0X9          (0x9u<<0)
#define GPIO_AFRL_AFSEL0_B_0XA          (0xAu<<0)
#define GPIO_AFRL_AFSEL0_B_0XB          (0xBu<<0)
#define GPIO_AFRL_AFSEL0_B_0XC          (0xCu<<0)
#define GPIO_AFRL_AFSEL0_B_0XD          (0xDu<<0)
#define GPIO_AFRL_AFSEL0_B_0XE          (0xEu<<0)
#define GPIO_AFRL_AFSEL0_B_0XF          (0xFu<<0)

// AFRH Configuration

