Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpio.h
#define GPIO_BRR_BR15                   (0x1u<<15)
#define GPIO_BRR_BR14                   (0x1u<<14)
#define GPIO_BRR_BR13                   (0x1u<<13)
#define GPIO_BRR_BR12                   (0x1u<<12)
#define GPIO_BRR_BR11                   (0x1u<<11)
#define GPIO_BRR_BR10                   (0x1u<<10)
#define GPIO_BRR_BR9                    (0x1u<<9)
#define GPIO_BRR_BR8                    (0x1u<<8)
#define GPIO_BRR_BR7                    (0x1u<<7)
#define GPIO_BRR_BR6                    (0x1u<<6)
#define GPIO_BRR_BR5                    (0x1u<<5)
#define GPIO_BRR_BR4                    (0x1u<<4)
#define GPIO_BRR_BR3                    (0x1u<<3)
#define GPIO_BRR_BR2                    (0x1u<<2)
#define GPIO_BRR_BR1                    (0x1u<<1)
#define GPIO_BRR_BR0                    (0x1u<<0)

#define GPIO_BRR_BR15_B_0X0             (0x0u<<15)
#define GPIO_BRR_BR15_B_0X1             (0x1u<<15)
#define GPIO_BRR_BR14_B_0X0             (0x0u<<14)
#define GPIO_BRR_BR14_B_0X1             (0x1u<<14)
#define GPIO_BRR_BR13_B_0X0             (0x0u<<13)
#define GPIO_BRR_BR13_B_0X1             (0x1u<<13)
#define GPIO_BRR_BR12_B_0X0             (0x0u<<12)
#define GPIO_BRR_BR12_B_0X1             (0x1u<<12)
#define GPIO_BRR_BR11_B_0X0             (0x0u<<11)
#define GPIO_BRR_BR11_B_0X1             (0x1u<<11)
#define GPIO_BRR_BR10_B_0X0             (0x0u<<10)
#define GPIO_BRR_BR10_B_0X1             (0x1u<<10)
#define GPIO_BRR_BR9_B_0X0              (0x0u<<9)
#define GPIO_BRR_BR9_B_0X1              (0x1u<<9)
#define GPIO_BRR_BR8_B_0X0              (0x0u<<8)
#define GPIO_BRR_BR8_B_0X1              (0x1u<<8)
#define GPIO_BRR_BR7_B_0X0              (0x0u<<7)
#define GPIO_BRR_BR7_B_0X1              (0x1u<<7)
#define GPIO_BRR_BR6_B_0X0              (0x0u<<6)
#define GPIO_BRR_BR6_B_0X1              (0x1u<<6)
#define GPIO_BRR_BR5_B_0X0              (0x0u<<5)
#define GPIO_BRR_BR5_B_0X1              (0x1u<<5)
#define GPIO_BRR_BR4_B_0X0              (0x0u<<4)
#define GPIO_BRR_BR4_B_0X1              (0x1u<<4)
#define GPIO_BRR_BR3_B_0X0              (0x0u<<3)
#define GPIO_BRR_BR3_B_0X1              (0x1u<<3)
#define GPIO_BRR_BR2_B_0X0              (0x0u<<2)
#define GPIO_BRR_BR2_B_0X1              (0x1u<<2)
#define GPIO_BRR_BR1_B_0X0              (0x0u<<1)
#define GPIO_BRR_BR1_B_0X1              (0x1u<<1)
#define GPIO_BRR_BR0_B_0X0              (0x0u<<0)
#define GPIO_BRR_BR0_B_0X1              (0x1u<<0)

// HSLVR Configuration

#define GPIO_HSLVR_HSLV15               (0x1u<<15)
#define GPIO_HSLVR_HSLV14               (0x1u<<14)
#define GPIO_HSLVR_HSLV13               (0x1u<<13)
#define GPIO_HSLVR_HSLV12               (0x1u<<12)
#define GPIO_HSLVR_HSLV11               (0x1u<<11)
#define GPIO_HSLVR_HSLV10               (0x1u<<10)
#define GPIO_HSLVR_HSLV9                (0x1u<<9)
#define GPIO_HSLVR_HSLV8                (0x1u<<8)
#define GPIO_HSLVR_HSLV7                (0x1u<<7)
#define GPIO_HSLVR_HSLV6                (0x1u<<6)
#define GPIO_HSLVR_HSLV5                (0x1u<<5)
#define GPIO_HSLVR_HSLV4                (0x1u<<4)
#define GPIO_HSLVR_HSLV3                (0x1u<<3)
#define GPIO_HSLVR_HSLV2                (0x1u<<2)
#define GPIO_HSLVR_HSLV1                (0x1u<<1)
#define GPIO_HSLVR_HSLV0                (0x1u<<0)

#define GPIO_HSLVR_HSLV15_B_0X0         (0x0u<<15)
#define GPIO_HSLVR_HSLV15_B_0X1         (0x1u<<15)
#define GPIO_HSLVR_HSLV14_B_0X0         (0x0u<<14)
#define GPIO_HSLVR_HSLV14_B_0X1         (0x1u<<14)
#define GPIO_HSLVR_HSLV13_B_0X0         (0x0u<<13)
#define GPIO_HSLVR_HSLV13_B_0X1         (0x1u<<13)
#define GPIO_HSLVR_HSLV12_B_0X0         (0x0u<<12)
#define GPIO_HSLVR_HSLV12_B_0X1         (0x1u<<12)
#define GPIO_HSLVR_HSLV11_B_0X0         (0x0u<<11)
#define GPIO_HSLVR_HSLV11_B_0X1         (0x1u<<11)
#define GPIO_HSLVR_HSLV10_B_0X0         (0x0u<<10)
#define GPIO_HSLVR_HSLV10_B_0X1         (0x1u<<10)
#define GPIO_HSLVR_HSLV9_B_0X0          (0x0u<<9)
#define GPIO_HSLVR_HSLV9_B_0X1          (0x1u<<9)
#define GPIO_HSLVR_HSLV8_B_0X0          (0x0u<<8)
#define GPIO_HSLVR_HSLV8_B_0X1          (0x1u<<8)
#define GPIO_HSLVR_HSLV7_B_0X0          (0x0u<<7)
#define GPIO_HSLVR_HSLV7_B_0X1          (0x1u<<7)
#define GPIO_HSLVR_HSLV6_B_0X0          (0x0u<<6)
#define GPIO_HSLVR_HSLV6_B_0X1          (0x1u<<6)
#define GPIO_HSLVR_HSLV5_B_0X0          (0x0u<<5)
#define GPIO_HSLVR_HSLV5_B_0X1          (0x1u<<5)
#define GPIO_HSLVR_HSLV4_B_0X0          (0x0u<<4)
#define GPIO_HSLVR_HSLV4_B_0X1          (0x1u<<4)
#define GPIO_HSLVR_HSLV3_B_0X0          (0x0u<<3)
#define GPIO_HSLVR_HSLV3_B_0X1          (0x1u<<3)
#define GPIO_HSLVR_HSLV2_B_0X0          (0x0u<<2)
#define GPIO_HSLVR_HSLV2_B_0X1          (0x1u<<2)
#define GPIO_HSLVR_HSLV1_B_0X0          (0x0u<<1)
#define GPIO_HSLVR_HSLV1_B_0X1          (0x1u<<1)
#define GPIO_HSLVR_HSLV0_B_0X0          (0x0u<<0)
#define GPIO_HSLVR_HSLV0_B_0X1          (0x1u<<0)

// SECCFGR Configuration

#define GPIO_SECCFGR_SEC15              (0x1u<<15)
#define GPIO_SECCFGR_SEC14              (0x1u<<14)
#define GPIO_SECCFGR_SEC13              (0x1u<<13)
#define GPIO_SECCFGR_SEC12              (0x1u<<12)
#define GPIO_SECCFGR_SEC11              (0x1u<<11)
#define GPIO_SECCFGR_SEC10              (0x1u<<10)
#define GPIO_SECCFGR_SEC9               (0x1u<<9)
#define GPIO_SECCFGR_SEC8               (0x1u<<8)
#define GPIO_SECCFGR_SEC7               (0x1u<<7)
#define GPIO_SECCFGR_SEC6               (0x1u<<6)
#define GPIO_SECCFGR_SEC5               (0x1u<<5)
#define GPIO_SECCFGR_SEC4               (0x1u<<4)
#define GPIO_SECCFGR_SEC3               (0x1u<<3)
#define GPIO_SECCFGR_SEC2               (0x1u<<2)
#define GPIO_SECCFGR_SEC1               (0x1u<<1)
#define GPIO_SECCFGR_SEC0               (0x1u<<0)

#define GPIO_SECCFGR_SEC15_B_0X0        (0x0u<<15)
#define GPIO_SECCFGR_SEC15_B_0X1        (0x1u<<15)
#define GPIO_SECCFGR_SEC14_B_0X0        (0x0u<<14)
#define GPIO_SECCFGR_SEC14_B_0X1        (0x1u<<14)
#define GPIO_SECCFGR_SEC13_B_0X0        (0x0u<<13)
#define GPIO_SECCFGR_SEC13_B_0X1        (0x1u<<13)
#define GPIO_SECCFGR_SEC12_B_0X0        (0x0u<<12)
#define GPIO_SECCFGR_SEC12_B_0X1        (0x1u<<12)
#define GPIO_SECCFGR_SEC11_B_0X0        (0x0u<<11)
#define GPIO_SECCFGR_SEC11_B_0X1        (0x1u<<11)
#define GPIO_SECCFGR_SEC10_B_0X0        (0x0u<<10)
#define GPIO_SECCFGR_SEC10_B_0X1        (0x1u<<10)
#define GPIO_SECCFGR_SEC9_B_0X0         (0x0u<<9)
#define GPIO_SECCFGR_SEC9_B_0X1         (0x1u<<9)
#define GPIO_SECCFGR_SEC8_B_0X0         (0x0u<<8)
#define GPIO_SECCFGR_SEC8_B_0X1         (0x1u<<8)
#define GPIO_SECCFGR_SEC7_B_0X0         (0x0u<<7)
#define GPIO_SECCFGR_SEC7_B_0X1         (0x1u<<7)
#define GPIO_SECCFGR_SEC6_B_0X0         (0x0u<<6)
#define GPIO_SECCFGR_SEC6_B_0X1         (0x1u<<6)
#define GPIO_SECCFGR_SEC5_B_0X0         (0x0u<<5)
#define GPIO_SECCFGR_SEC5_B_0X1         (0x1u<<5)
#define GPIO_SECCFGR_SEC4_B_0X0         (0x0u<<4)
#define GPIO_SECCFGR_SEC4_B_0X1         (0x1u<<4)
#define GPIO_SECCFGR_SEC3_B_0X0         (0x0u<<3)
#define GPIO_SECCFGR_SEC3_B_0X1         (0x1u<<3)
#define GPIO_SECCFGR_SEC2_B_0X0         (0x0u<<2)
#define GPIO_SECCFGR_SEC2_B_0X1         (0x1u<<2)
#define GPIO_SECCFGR_SEC1_B_0X0         (0x0u<<1)
#define GPIO_SECCFGR_SEC1_B_0X1         (0x1u<<1)
#define GPIO_SECCFGR_SEC0_B_0X0         (0x0u<<0)
#define GPIO_SECCFGR_SEC0_B_0X1         (0x1u<<0)

