Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_gpio.h
// DELAYRH Configuration

#define GPIO_DELAYRH_DELAY15            (0xFu<<28)
#define GPIO_DELAYRH_DELAY15_0          (0x1u<<28)
#define GPIO_DELAYRH_DELAY14            (0xFu<<24)
#define GPIO_DELAYRH_DELAY14_0          (0x1u<<24)
#define GPIO_DELAYRH_DELAY13            (0xFu<<20)
#define GPIO_DELAYRH_DELAY13_0          (0x1u<<20)
#define GPIO_DELAYRH_DELAY12            (0xFu<<16)
#define GPIO_DELAYRH_DELAY12_0          (0x1u<<16)
#define GPIO_DELAYRH_DELAY11            (0xFu<<12)
#define GPIO_DELAYRH_DELAY11_0          (0x1u<<12)
#define GPIO_DELAYRH_DELAY10            (0xFu<<8)
#define GPIO_DELAYRH_DELAY10_0          (0x1u<<8)
#define GPIO_DELAYRH_DELAY9             (0xFu<<4)
#define GPIO_DELAYRH_DELAY9_0           (0x1u<<4)
#define GPIO_DELAYRH_DELAY8             (0xFu<<0)
#define GPIO_DELAYRH_DELAY8_0           (0x1u<<0)

// PIOCFGRL Configuration

#define GPIO_PIOCFGRL_PIOCFG7           (0xFu<<28)
#define GPIO_PIOCFGRL_PIOCFG7_0         (0x1u<<28)
#define GPIO_PIOCFGRL_PIOCFG6           (0xFu<<24)
#define GPIO_PIOCFGRL_PIOCFG6_0         (0x1u<<24)
#define GPIO_PIOCFGRL_PIOCFG5           (0xFu<<20)
#define GPIO_PIOCFGRL_PIOCFG5_0         (0x1u<<20)
#define GPIO_PIOCFGRL_PIOCFG4           (0xFu<<16)
#define GPIO_PIOCFGRL_PIOCFG4_0         (0x1u<<16)
#define GPIO_PIOCFGRL_PIOCFG3           (0xFu<<12)
#define GPIO_PIOCFGRL_PIOCFG3_0         (0x1u<<12)
#define GPIO_PIOCFGRL_PIOCFG2           (0xFu<<8)
#define GPIO_PIOCFGRL_PIOCFG2_0         (0x1u<<8)
#define GPIO_PIOCFGRL_PIOCFG1           (0xFu<<4)
#define GPIO_PIOCFGRL_PIOCFG1_0         (0x1u<<4)
#define GPIO_PIOCFGRL_PIOCFG0           (0xFu<<0)
#define GPIO_PIOCFGRL_PIOCFG0_0         (0x1u<<0)

#define GPIO_PIOCFGRL_PIOCFG7_B_0X0     (0x0u<<28)
#define GPIO_PIOCFGRL_PIOCFG7_B_0X1     (0x1u<<28)
#define GPIO_PIOCFGRL_PIOCFG6_B_0X0     (0x0u<<24)
#define GPIO_PIOCFGRL_PIOCFG6_B_0X1     (0x1u<<24)
#define GPIO_PIOCFGRL_PIOCFG5_B_0X0     (0x0u<<20)
#define GPIO_PIOCFGRL_PIOCFG5_B_0X1     (0x1u<<20)
#define GPIO_PIOCFGRL_PIOCFG4_B_0X0     (0x0u<<16)
#define GPIO_PIOCFGRL_PIOCFG4_B_0X1     (0x1u<<16)
#define GPIO_PIOCFGRL_PIOCFG3_B_0X0     (0x0u<<12)
#define GPIO_PIOCFGRL_PIOCFG3_B_0X1     (0x1u<<12)
#define GPIO_PIOCFGRL_PIOCFG2_B_0X0     (0x0u<<8)
#define GPIO_PIOCFGRL_PIOCFG2_B_0X1     (0x1u<<8)
#define GPIO_PIOCFGRL_PIOCFG1_B_0X0     (0x0u<<4)
#define GPIO_PIOCFGRL_PIOCFG1_B_0X1     (0x1u<<4)
#define GPIO_PIOCFGRL_PIOCFG0_B_0X0     (0x0u<<0)
#define GPIO_PIOCFGRL_PIOCFG0_B_0X1     (0x1u<<0)

// PIOCFGRH Configuration

#define GPIO_PIOCFGRH_PIOCFG15          (0xFu<<28)
#define GPIO_PIOCFGRH_PIOCFG15_0        (0x1u<<28)
#define GPIO_PIOCFGRH_PIOCFG14          (0xFu<<24)
#define GPIO_PIOCFGRH_PIOCFG14_0        (0x1u<<24)
#define GPIO_PIOCFGRH_PIOCFG13          (0xFu<<20)
#define GPIO_PIOCFGRH_PIOCFG13_0        (0x1u<<20)
#define GPIO_PIOCFGRH_PIOCFG12          (0xFu<<16)
#define GPIO_PIOCFGRH_PIOCFG12_0        (0x1u<<16)
#define GPIO_PIOCFGRH_PIOCFG11          (0xFu<<12)
#define GPIO_PIOCFGRH_PIOCFG11_0        (0x1u<<12)
#define GPIO_PIOCFGRH_PIOCFG10          (0xFu<<8)
#define GPIO_PIOCFGRH_PIOCFG10_0        (0x1u<<8)
#define GPIO_PIOCFGRH_PIOCFG9           (0xFu<<4)
#define GPIO_PIOCFGRH_PIOCFG9_0         (0x1u<<4)
#define GPIO_PIOCFGRH_PIOCFG8           (0xFu<<0)
#define GPIO_PIOCFGRH_PIOCFG8_0         (0x1u<<0)
